In [28]:
import pandas as pd
import selenium
from selenium import webdriver
import warnings
warnings.filterwarnings("ignore")
from selenium.webdriver.common.keys import Keys
from selenium.common.exceptions import StaleElementReferenceException,NoSuchElementException
from selenium.webdriver.common.by import By
import time
from bs4 import BeautifulSoup
import requests 
import re

In [29]:
driver=webdriver.Chrome(r"C:\Users\GauRav SingH\Desktop\Internship\Selenium\chromedriver.exe")

### Q1: Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You
have to scrape the 
job-title, job-location, company_name, experience_required. You have to scrape first 10
jobs data.

In [17]:
driver.get("https://www.naukri.com/")

In [18]:
designation=driver.find_element(By.CLASS_NAME,"suggestor-input")

In [19]:
designation.send_keys("Data Analyst")

In [20]:
location=driver.find_element(By.XPATH,"/html/body/div[1]/div[6]/div/div/div[5]/div/div/div/input")

In [21]:
location.send_keys("Bangalore")

In [22]:
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [23]:
job_location=[]
company_name=[]
experience_required=[]

In [24]:
job_title=[]
title_tags=driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in title_tags[0:10]:
    title=i.text
    job_title.append(title)

job_tags=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in job_tags[0:10]:
    job=i.text
    job_location.append(job)

company_n=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in company_n[0:10]:
    cmp=i.text
    company_name.append(cmp)

    
experienced=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in experienced[0:10]:
    exp=i.text
    experience_required.append(exp)

In [25]:
print(len(company_name))

10

In [26]:
df=pd.DataFrame({"Title":job_title,"Location":job_location,"Company_Name":company_name,"Experience":experience_required})

In [27]:
df

,Title,Location,Company_Name,Experience
0,Graduate Data Analyst,Hybrid - Bangalore/Bengaluru,Kwalee India,0-2 Yrs
1,Data Analyst,Permanent Remote,Novitas Infotech,3-8 Yrs
2,Data Analyst,Bangalore/Bengaluru,Truecaller,3-5 Yrs
3,Data Analyst,"Hybrid - Bangalore/Bengaluru, Chennai",Virtusa,6-11 Yrs
4,Urgent Hiring | Data Analyst with GCP experience,"Temp. WFH - Bangalore/Bengaluru, Noida, Pune, ...",Infogain,2-7 Yrs
5,Data Analyst,"Hybrid - Bangalore/Bengaluru, Hyderabad/Secund...",People De Code Solutions,4-9 Yrs
6,Hiring For Data Analyst,Hybrid - Bangalore/Bengaluru,Absolutdata,4-6 Yrs
7,Data Analyst,Hybrid - Bangalore/Bengaluru,Spire Technology,0-0 Yrs
8,Data Analyst- Yulu Energy,Bangalore/Bengaluru,Yulu Bikes,0-1 Yrs
9,Data Analyst,Bangalore/Bengaluru,Entrupy,1-3 Yrs

In [28]:
url=driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')

In [29]:
job_url=[]
for i in url[0:10]:
    job_url.append(i.get_attribute("href"))

In [30]:
 job_url

['https://www.naukri.com/job-listings-graduate-data-analyst-kwalee-india-bangalore-bengaluru-0-to-2-years-220223004388',
 'https://www.naukri.com/job-listings-data-analyst-novitas-infotech-bangalore-bengaluru-3-to-8-years-210223009488',
 'https://www.naukri.com/job-listings-data-analyst-true-caller-bangalore-bengaluru-3-to-5-years-220223500535',
 'https://www.naukri.com/job-listings-data-analyst-virtusa-chennai-bangalore-bengaluru-6-to-11-years-220223010865',
 'https://www.naukri.com/job-listings-urgent-hiring-data-analyst-with-gcp-experience-infogain-noida-pune-bangalore-bengaluru-mumbai-all-areas-2-to-7-years-220223010141',
 'https://www.naukri.com/job-listings-data-analyst-people-de-code-solutions-hyderabad-secunderabad-chennai-bangalore-bengaluru-4-to-9-years-230223004852',
 'https://www.naukri.com/job-listings-hiring-for-data-analyst-absolutdata-bangalore-bengaluru-4-to-6-years-210223010216',
 'https://www.naukri.com/job-listings-data-analyst-spire-technology-bangalore-bengaluru-0-to-0-years-200223000925',
 'https://www.naukri.com/job-listings-data-analyst-yulu-energy-yulu-bike-bangalore-bengaluru-0-to-1-years-160223502171',
 'https://www.naukri.com/job-listings-data-analyst-entrupy-bangalore-bengaluru-1-to-3-years-100223501402']

## Q2:Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You
have to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data.
This task will be done in following steps:
1. First get the webpage https://www.naukri.com/
2. Enter “Data Scientist” in “Skill, Designations, Companies” field and enter “Bangalore” in “enter the
location” field.
3. Then click the searchbutton.
4. Then scrape the data for the first 10 jobs results youget.
5. Finally create a dataframe of the scraped data.

In [98]:
driver.get("https://www.naukri.com/")

In [99]:
designation_2=driver.find_element(By.CLASS_NAME,"suggestor-input")
designation_2.send_keys("Data Scientist")

location_2=driver.find_element(By.XPATH,"/html/body/div[1]/div[6]/div/div/div[5]/div/div/div/input")
location_2.send_keys("Bangalore")

search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [100]:
job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [101]:
j_title=driver.find_elements(By.XPATH,'//a[@class="title ellipsis"]')
for i in j_title[0:10]:
    job_title.append(i.text)

    
j_loc=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft locWdth"]')
for i in j_loc[0:10]:
    job_location.append(i.text)

    
c_name=driver.find_elements(By.XPATH,'//a[@class="subTitle ellipsis fleft"]')
for i in c_name[0:10]:
    company_name.append(i.text)
    
    
exe_req=driver.find_elements(By.XPATH,'//span[@class="ellipsis fleft expwdth"]')
for i in exe_req[0:10]:
    experience_required.append(i.text)

In [102]:
job_location

['Bangalore/Bengaluru, Kolkata, Mumbai, Hyderabad/Secunderabad, Pune, Chennai',
 'Bangalore/Bengaluru, Kolkata, Mumbai, Hyderabad/Secunderabad, Pune, Chennai',
 'Hybrid - Bangalore/Bengaluru, Kolkata, Hyderabad/Secunderabad, Pune, Chennai, Delhi / NCR, Mumbai (All Areas)',
 'Bangalore/Bengaluru, Mumbai',
 'Bangalore/Bengaluru, Hyderabad/Secunderabad, Mumbai (All Areas)',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru, Mumbai',
 'Bangalore/Bengaluru',
 'Bangalore/Bengaluru',
 'Temp. WFH - Bangalore/Bengaluru, Hyderabad/Secunderabad']

In [103]:
df=pd.DataFrame({"Title":job_title,"Location":job_location,"Company_Name":company_name,"Experience":experience_required})
df

,Title,Location,Company_Name,Experience
0,Data Science Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,2-4 Yrs
1,Analystics & Modeling Specialist,"Bangalore/Bengaluru, Kolkata, Mumbai, Hyderaba...",Accenture,6-8 Yrs
2,Data Scientist,"Hybrid - Bangalore/Bengaluru, Kolkata, Hyderab...",Cognizant,8-10 Yrs
3,Staff Data Scientist,"Bangalore/Bengaluru, Mumbai",Baker Hughes,10-12 Yrs
4,Sr. Data scientist,"Bangalore/Bengaluru, Hyderabad/Secunderabad, M...",Tata Consultancy Services (TCS),7-12 Yrs
5,Physicist / Scientist,Bangalore/Bengaluru,Applied Materials,4-7 Yrs
6,Expert Data Scientist,"Bangalore/Bengaluru, Mumbai",UPL Limited,8-10 Yrs
7,"SR. SPECIALIST, DATA ANALYTICS",Bangalore/Bengaluru,AT and T Global Business Services India P. Ltd.,5-10 Yrs
8,Senior Data Scientist,Bangalore/Bengaluru,AT and T Global Business Services India P. Ltd.,5-8 Yrs
9,Data Scientist Architect,"Temp. WFH - Bangalore/Bengaluru, Hyderabad/Sec...",Brace Infotech,11-20 Yrs

### Q3: In this question you have to scrape data using the filters available on the webpage as shown below:

The task will be done as shown in the below steps:
1. first get thewebpage https://www.naukri.com/
2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.
3. Then click the searchbutton.
4. Then apply the location filter and salary filter by checking the respective boxes
5. Then scrape the data for the first 10 jobs results youget.
6. Finally create a dataframe of the scraped data.

### Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:
1. Brand
2. ProductDescription
3. Price
4. discount price

In [295]:
driver.get("https://www.flipkart.com/")
brand=driver.find_element(By.CLASS_NAME,"_3704LK")
brand.send_keys("sunglasses")
search=driver.find_element(By.CLASS_NAME,"L0Z3Pu")
search.click()

In [296]:
Brand=[]
productDescription=[]
Price=[]
Discount_percnt=[]
#name=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
#for i in name[0:40]:
#    brand_name.append(i.text)

In [297]:
start=0
end=3
for page in range(start,end):
    name=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    desc=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    price=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    percent_off=driver.find_elements(By.XPATH,'//div[@class="_3Ay6Sb"]')
    
            
    
    for i in name[0:33]:
        Brand.append(i.text)
    for i in desc[0:33]:
        productDescription.append(i.text.strip().split('(')[0])
    for i in price[0:33]:
        Price.append(i.text)
    for i in percent_off[0:33]:
        Discount_percnt.append(i.text)
    
    
    next_btn=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_btn.click()
    time.sleep(3)

In [298]:
print(len(Discount_percnt))

99

In [299]:
df_4=pd.DataFrame({"Brand":Brand,"Product_Desc":productDescription,"Price":Price,"Discount_percent":Discount_percnt})

In [300]:
df_4

,Brand,Product_Desc,Price,Discount_percent
0,ROZZETTA CRAFT,"UV Protection, Gradient Rectangular Sunglasses",₹423,78% off
1,OAKLEY,Shield Sunglass,"₹6,149",30% off
2,Elligator,"UV Protection Cat-eye, Retro Square, Oval, Rou...",₹219,63% off
3,Fastrack,UV Protection Aviator Sunglasses,₹579,35% off
4,Fastrack,UV Protection Rectangular Sunglasses,₹519,35% off
...,...,...,...,...
94,PIRASO,UV Protection Rectangular Sunglasses,₹254,84% off
95,NuVew,"UV Protection, Mirrored Aviator Sunglasses",₹129,82% off
96,NuVew,UV Protection Aviator Sunglasses,₹125,83% off
97,IZAAN MART,UV Protection Cat-eye Sunglasses,₹225,77% off
98,VINCENT CHASE,"Polarized, UV Protection Round Sunglasses",₹799,60% off

### Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone.

1. Rating
2. Review summary
3. Full review
4. You have to scrape this data for first 100reviews

In [33]:
url_5="https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&market"
driver.get(url_5)

In [34]:
Rating=[]
Review_summary=[]
Full_review=[]

In [35]:
start=0
end=10
for page in range(start,end):
    rating=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
    Review_summ=driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
    Full_rev=driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]')
                   
       
    for i in rating[0:10]:
        Rating.append(i.text)
        
    for i in Review_summ[0:10]:
        Review_summary.append(i.text) 
        
    for i in Full_rev[0:10]:
        Full_review.append(i.text)
        
        
    next_btn=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_btn.click()
    time.sleep(3)

In [39]:
print(len(Rating)),print(len(Review_summary)),print(len(Full_review))

100
100
100

(None, None, None)

In [40]:
df_5=pd.DataFrame({"Rating":Rating,"Review_summary":Review_summary,"Full_review":Full_review})

In [41]:
df_5

,Rating,Review_summary,Full_review
0,5,Simply awesome,Really satisfied with the Product I received.....
1,5,Perfect product!,Amazing phone with great cameras and better ba...
2,5,Best in the market!,Great iPhone very snappy experience as apple k...
3,4,Value-for-money,I'm Really happy with the product\nDelivery wa...
4,5,Highly recommended,It's my first time to use iOS phone and I am l...
...,...,...,...
95,4,Value-for-money,Just got this iphone 11\nAnd it is most powerf...
96,5,Perfect product!,Value for money❤️❤️\nIts awesome mobile phone ...
97,5,Highly recommended,iphone 11 is a very good phone to buy only if ...
98,5,Highly recommended,"Amazing camera quality as expected, battery al..."
99,5,Perfect product!,It is just awesome mobile for this price from ...

### Q6: Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in the
search field.
You have to scrape 3 attributes of each sneaker:
1. Brand
2. ProductDescription
3. Price

In [30]:
#url_6="https://www.flipkart.com"
driver.get("https://www.flipkart.com")

In [50]:
brand=driver.find_element(By.CLASS_NAME,"_3704LK")
brand.send_keys("sneaker")
search=driver.find_element(By.CLASS_NAME,"_34RNph")
search.click()

In [44]:
Brand=[]
ProductDescription=[]
Price=[]

In [51]:
start=0
end=4
for page in range(start,end):
    brn=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    pro_desc=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    price=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
                   
       
    for i in brn[0:25]:
        Brand.append(i.text)
        
    for i in pro_desc[0:25]:
        ProductDescription.append(i.text) 
        
    for i in price[0:25]:
        Price.append(i.text)
        
        
    next_btn=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
    next_btn.click()
    time.sleep(3)

In [52]:
print(len(Brand)),print(len(Price)),print(len(ProductDescription))

100
100
100

(None, None, None)

In [53]:
df_6=pd.DataFrame({"Brand":Brand,"Product_Description":ProductDescription,"Price":Price})

In [54]:
df_6

          Brand                                Product_Description   Price
0          aadi  Synthetic Leather |Lightweight|Comfort|Summer|...    ₹399
1      RapidBox                                   Sneakers For Men    ₹571
2           SFR                                   Sneakers For Men    ₹249
3          aadi  Synthetic Leather |Lightweight|Comfort|Summer|...    ₹299
4           SFR                                   Sneakers For Men    ₹243
..          ...                                                ...     ...
95        Sparx       Combo Pack of 2 Casual Shoe Sneakers For Men    ₹899
96        BIRDE  Comfy Mid-Top Casual Chunky Streetwear Fashion...    ₹499
97  bacca bucci  Mesh |Lightweight|Comfort|Summer|Trendy|Walkin...  ₹1,599
98         aadi           WATERPROOF-05cFULLWHITE Sneakers For Men    ₹399
99        asian  Mesh |Lightweight|Comfort|Summer|Trendy|Walkin...    ₹649

[100 rows x 3 columns]

### Q7: Go to webpage https://www.amazon.in/ 

Enter “Laptop” in the search field and then click the search icon.Then

set CPU Type filter to “Intel Core i7” as shown in the below image:

After setting the filters scrape first 10 laptops data. You have to scrape 3 attributes for each laptop:
1. Title
2. Ratings
3. Price

In [81]:
driver.get("https://amazon.in/")

In [82]:
Title=[]
Rating=[]
Price=[]

In [83]:
search_tab=driver.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input')
search_tab.send_keys("Laptop")
search=driver.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div/span/input')
search.click()
press=driver.find_element(By.XPATH,'/html/body/div[1]/div[2]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[7]/li[11]/span/a/div')
press.click()

In [84]:
lap_title=driver.find_elements(By.XPATH,'//span[@class="a-size-medium a-color-base a-text-normal"]')
lap_rating=driver.find_elements(By.XPATH,'//span[@class="a-size-base"]')
lap_price=driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in lap_title[0:10]:
    Title.append(i.text)
    
for i in lap_rating[0:10]:
    Rating.append(i.text)

for i in lap_price[0:10]:
    Price.append(i.text)

In [85]:
print(len(Title)),print(len(Rating)),print(len(Price))

10
10
10

(None, None, None)

In [86]:
df_7=pd.DataFrame({"Title":Title,"Rating":Rating,"Price":Price})

In [87]:
df_7

                                               Title Rating   Price
0  ASUS Vivobook 14, Intel Core i7-1165G7 11th Ge...    4.1  56,990
1  (Renewed) HP ProBook 430 G3 6th Gen Intel Core...    3.4  24,889
2  HP Pavilion Plus, 12th Gen Intel Core i7 16GB ...    4.0  95,990
3  HP Victus Gaming Latest 12th Gen Intel Core i7...    4.3  85,990
4  MSI GF75 Thin Gaming, Intel Core i7-10750H, 44...    4.4  62,990
5  Samsung Galaxy Book2 (NP750) Intel 12th Gen co...    4.1  79,990
6  Hp Pavilion 15 12Th Gen Intel Core I7 16Gb Sdr...    3.8  89,990
7  ASUS TUF Gaming F15 (2022), 15.6" (39.62 cms) ...    4.1  98,400
8  Fujitsu UH-X 11th Gen Intel Core i7 13.3" FHD ...    4.3  89,990
9  HP Victus 12th Gen Intel Core i7 15.6 inch(39....    3.4  95,490

### Q8: Write a python program to scrape data for Top 1000 Quotes of All Time.
The above task will be done in following steps:

1. First get the webpagehttps://www.azquotes.com/
2. Click on TopQuotes
3. Than scrap 

 a) Quote

 b) Author 

 c) Type Of Quotes

In [117]:
driver.get("https://www.azquotes.com/")

In [118]:
top_quote=driver.find_element(By.XPATH,'//a[@href="/top_quotes.html"]')
top_quote.click()

In [119]:
quote=[]
author=[]
type_of_quote=[]

In [120]:
start=0
end=10
for page in range(start,end):
    qu=driver.find_elements(By.XPATH,'//a[@class="title"]')
    auth=driver.find_elements(By.XPATH,'//div[@class="author"]')
    ty_of_qu=driver.find_elements(By.XPATH,'//div[@class="tags"]')    
    
    for i in qu[0:100]:
        quote.append(i.text)
    for i in auth[0:100]:
        author.append(i.text)
    for i in ty_of_qu[0:100]:
        type_of_quote.append(i.text)
        
    next_btn=driver.find_element(By.XPATH,'//a[@href="top_quotes.html?p=2"]')
    next_btn.click()
    time.sleep(3)

In [121]:
print(len(quote)),print(len(author)),print(len(type_of_quote))

1000
1000
1000

(None, None, None)

In [122]:
df_8=pd.DataFrame({"Quote":quote,"Author":author,"Type_of_Quote":type_of_quote})

In [123]:
df_8

,Quote,Author,Type_of_Quote
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
995,"When one door closes, another opens; but we of...",Alexander Graham Bell,"Love, Inspirational, Life"
996,"Don't find fault, find a remedy.",Henry Ford,"Inspirational, Motivational, Positive"
997,I used to think the worst thing in life was to...,Robin Williams,"Love, Life, Lonely"
998,Friends and good manners will carry you where ...,Margaret Walker,"Love, Inspirational, Friendship"
999,"If you want to make a permanent change, stop f...",T. Harv Eker,"Inspirational, Change, Inspiring"

### Q9: Write a python program to display list of respected former 
Prime Ministers of India(i.e. Name, Born-Dead,Term of office, Remarks) from https://www.jagranjosh.com/.
This task will be done in following steps:
1. First get the webpagehttps://www.jagranjosh.com/
2. Then You have to click on the GK option
3. Then click on the List of all Prime Ministers of India
4. Then scrap the mentioned data and make theDataFrame

# sir i try so many times but it wont work

In [3]:
driver.get(" https://www.jagranjosh.com/")

In [4]:
Name=[]
Born_dead=[]
Term_of_office=[]
Remarks=[]

In [5]:
gk=driver.find_element(By.XPATH,'/html/body/div/div[1]/div/div[1]/div/div[5]/div/div[1]/header/div[3]/ul/li[9]/a')
gk.click()

In [7]:
pm_list=driver.find_element(By.XPATH,'/html/body/div[1]/div/div/div[2]/div/div[10]/div/div/ul/li[2]/a')
pm_list.click()

In [24]:
#name=driver.find_elements(By.TAG_NAME, "p")
name=driver.find_elements(By.XPATH,'/html/body/div[1]/div[2]/div/div[2]/div/div[1]/div/div/div/div[4]/span/div[2]/table/tbody/tr[3]/td[3]')

In [26]:
name[].text

IndexError: list index out of range

In [184]:
start=6
end=108
for i in name[6:108]:
    name[0].text.strip(' ').split('\n')[6]
    i+=6
    Name.append(i.text.strip(' ').split('\n'))

NameError: name 'name' is not defined

In [55]:
Name

[]

### Q10: Write a python program to display list of 50 Most expensive cars in the world (i.e.
Car name and Price) from https://www.motor1.com/
This task will be done in following steps:
1. First get the webpagehttps://www.motor1.com/
2. Then You have to click on the List option from Dropdown menu on leftside.
3. Then click on 50 most expensive carsin the world..
4. Then scrap the mentioned data and make the dataframe.

In [112]:
Price=[]

In [102]:
Carname=[]

In [7]:
driver.get("https://www.motor1.com/")

In [8]:
dropdown=driver.find_element(By.CLASS_NAME,"m1-hamburger-button")
dropdown.click()

In [9]:
features=driver.find_element(By.XPATH,'/html/body/div[4]/div[1]/div[3]/ul/li[5]/a')
features.click()

In [12]:
top_50=driver.find_element(By.XPATH,'/html/body/div[3]/div[9]/div[1]/div[1]/div/div/div[5]/div/div[1]/h3/a')
top_50.click()

In [93]:
car_name=driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
limit=50

In [95]:
car_name[0].text

'De Tomaso P72'

In [96]:
car_name_1=[]

In [15]:
car_name[49].text

'Rolls-Royce Boat Tail*'

In [97]:
for index, item in enumerate(car_name):
    #print(item)
    if index == limit: # There's gotta be a better way.
        break 
    car_name_1.append(item)
    
#for i in range(0,car_name):
#    Carname.append(i.tex)

In [98]:
car_name_1[49].text

'Rolls-Royce Boat Tail*'

In [103]:
for i in car_name_1:
    Carname.append(i.text)

In [105]:
Carname

['De Tomaso P72',
 'Ferrari LaFerrari',
 'Pagani Huayra',
 'McLaren Elva',
 'Czinger 21C',
 'Ferrari Monza',
 'Gordon Murray T.33',
 'Koenigsegg Gemera',
 'Zenvo TSR-S',
 'Hennessey Venom F5',
 'Bentley Bacalar',
 'Hispano Suiza Carmen Boulogne',
 'Bentley Mulliner Batur',
 'Deus Vayanne',
 'SSC Tuatara',
 'Lotus Evija',
 'Aston Martin Vulcan',
 'Delage D12',
 'McLaren Speedtail',
 'Rimac Nevera',
 'Pagani Utopia',
 'Pininfarina Battista',
 'Ferrari FXX K Evo',
 'Gordon Murray T.50',
 'Lamborghini Countach',
 'Mercedes-AMG Project One',
 'Aston Martin Victor',
 'Hennessey Venom F5 Roadster',
 'Koenigsegg Jesko',
 'Aston Martin Valkyrie',
 'W Motors Lykan Hypersport',
 'McLaren Solus',
 'Pagani Huayra Roadster BC',
 'Bugatti Chiron Pur Sport',
 'Lamborghini Sian',
 'Koenigsegg CC850',
 'Bugatti Chiron Super Sport 300+',
 'Lamborghini Veneno',
 'Bugatti Bolide',
 'Bugatti Mistral',
 'Pagani Huayra Imola',
 'Bugatti Divo',
 'SP Automotive Chaos',
 'Pagani Codalunga',
 'Mercedes-Maybach Exelero',
 'Bugatti Centodieci',
 'Bugatti Chiron Profilée',
 'Rolls-Royce Sweptail',
 'Bugatti La Voiture Noire',
 'Rolls-Royce Boat Tail*']

In [152]:
price=driver.find_elements(By.XPATH,'//strong')
price[0].text.split(":")[1]

' $1.3 Million'

In [158]:
price_1=[]

In [159]:
for index, item in enumerate(price):
    #print(item)
    if index == 3: # There's gotta be a better way.
        continue 
    price_1.append(item)

In [163]:
Price=[]

In [164]:
for i in price_1:
    #price_clean=i.text
    Price.append(i.text)

In [165]:
price_1[0].text

'Price: $1.3 Million'

In [166]:
Price[0].strip().split(":")[1]

' $1.3 Million'

In [167]:
len(Price),len(Carname)

(50, 50)

In [172]:
top_4_cars=pd.DataFrame({"Carname":Carname,"Price":Price})

In [173]:
top_4_cars

                            Carname                        Price
0                     De Tomaso P72          Price: $1.3 Million
1                 Ferrari LaFerrari          Price: $1.4 Million
2                     Pagani Huayra          Price: $1.4 Million
3                      McLaren Elva          Price: $1.7 Million
4                       Czinger 21C          Price: $1.7 Million
5                     Ferrari Monza          Price: $1.7 Million
6                Gordon Murray T.33          Price: $1.7 Million
7                 Koenigsegg Gemera          Price: $1.7 Million
8                       Zenvo TSR-S          Price: $1.7 Million
9                Hennessey Venom F5          Price: $1.8 Million
10                  Bentley Bacalar          Price: $1.9 Million
11    Hispano Suiza Carmen Boulogne          Price: $1.9 Million
12           Bentley Mulliner Batur          Price: $2.0 Million
13                     Deus Vayanne          Price: $2.0 Million
14                      SSC Tuatara         Price: $2.0 Million*
15                      Lotus Evija          Price: $2.1 Million
16              Aston Martin Vulcan          Price: $2.3 Million
17                       Delage D12          Price: $2.3 Million
18                McLaren Speedtail          Price: $2.3 Million
19                     Rimac Nevera          Price: $2.4 Million
20                    Pagani Utopia          Price: $2.5 Million
21             Pininfarina Battista          Price: $2.5 Million
22                Ferrari FXX K Evo          Price: $2.6 Million
23               Gordon Murray T.50          Price: $2.6 Million
24             Lamborghini Countach          Price: $2.6 Million
25         Mercedes-AMG Project One          Price: $2.7 Million
26              Aston Martin Victor          Price: $3.0 Million
27      Hennessey Venom F5 Roadster                 $3.0 Million
28                 Koenigsegg Jesko          Price: $3.0 Million
29            Aston Martin Valkyrie          Price: $3.2 Million
30        W Motors Lykan Hypersport          Price: $3.4 Million
31                    McLaren Solus                 $3.5 Million
32        Pagani Huayra Roadster BC          Price: $3.5 Million
33         Bugatti Chiron Pur Sport          Price: $3.6 Million
34                 Lamborghini Sian          Price: $3.6 million
35                 Koenigsegg CC850          Price: $3.7 Million
36  Bugatti Chiron Super Sport 300+          Price: $3.9 Million
37               Lamborghini Veneno          Price: $4.5 Million
38                   Bugatti Bolide          Price: $4.7 Million
39                  Bugatti Mistral          Price: $5.0 Million
40              Pagani Huayra Imola          Price: $5.4 Million
41                     Bugatti Divo          Price: $5.8 Million
42              SP Automotive Chaos          Price: $6.4 Million
43                 Pagani Codalunga          Price: $7.4 Million
44         Mercedes-Maybach Exelero          Price: $8.0 Million
45               Bugatti Centodieci          Price: $9.0 Million
46          Bugatti Chiron Profilée         Price: $10.8 Million
47             Rolls-Royce Sweptail         Price: $12.8 Million
48         Bugatti La Voiture Noire         Price: $13.4 Million
49           Rolls-Royce Boat Tail*  Price: $28.0 Million (est.)

In [175]:
top_4_cars.to_csv("top_50_cars")